In [63]:
import altair as alt
import pandas as pd
import numpy as np
import streamlit as st

In [64]:
student_names = ['Patrick Dickey', 'Tom Yoxsimer','Cole Bauguess','Kevin Mcdonald','William Landon','Duane Shelton']
student_ids = [800100200, 800100201,800100202,800100203,800100204,800100205]
print(student_names)
print(student_ids)

['Patrick Dickey', 'Tom Yoxsimer', 'Cole Bauguess', 'Kevin Mcdonald', 'William Landon', 'Duane Shelton']
[800100200, 800100201, 800100202, 800100203, 800100204, 800100205]

In [65]:
students_df = pd.DataFrame(student_names)

students_df.rename(columns = {0:'student_name'}, inplace = True)
students_df['student_id'] = student_ids
students_df

     student_name  student_id
0  Patrick Dickey   800100200
1    Tom Yoxsimer   800100201
2   Cole Bauguess   800100202
3  Kevin Mcdonald   800100203
4  William Landon   800100204
5   Duane Shelton   800100205

In [82]:
club_names = ['Chess Club','Ultimate Frisbee','Archery Club','Alpha Sigma Phi','Rho Tau Sigma']
club_id = [1,2,3,4,5]
club_size = [50,60,10,120,70]
activity = [50,50,50,50,50]
communication = ['https://discord.gg/2DmmD9qm','GroupMe invite','https://discord.gg/2DmmD9qm','https://discord.gg/2DmmD9qm','https://discord.gg/2DmmD9qm']
club_df = pd.DataFrame(club_names)
club_df['club_id'] = club_id
club_df['club_size'] = club_size
club_df['activity'] = activity
club_df['communication'] = communication
club_df.rename(columns = {0:'club_name'}, inplace = True)
club_df

          club_name  club_id  club_size  activity                communication
0        Chess Club        1         50        50  https://discord.gg/2DmmD9qm
1  Ultimate Frisbee        2         60        50               GroupMe invite
2      Archery Club        3         10        50  https://discord.gg/2DmmD9qm
3   Alpha Sigma Phi        4        120        50  https://discord.gg/2DmmD9qm
4     Rho Tau Sigma        5         70        50  https://discord.gg/2DmmD9qm

In [67]:
roles = ['President','Captain', 'Vice President', 'Officer', 'Treasurer','President']
membership_df = pd.DataFrame(roles)
membership_df['club_id'] = [1,2,3,4,5,4]
membership_df['student_id'] = student_ids
membership_df.rename(columns = {0:'role'}, inplace = True)
membership_df

             role  club_id  student_id
0       President        1   800100200
1         Captain        2   800100201
2  Vice President        3   800100202
3         Officer        4   800100203
4       Treasurer        5   800100204
5       President        4   800100205

In [135]:
# Join club
# Inputs required: student_id, club_id, role (default = member)
student_id = 800100200
club_id = 3
role = 'Member'
def join_club(student_id, club_id, role):
    membership_df.loc[len(membership_df.index)] = [role, club_id, student_id]
    print(membership_df)
#membership_df = membership_df.iloc[:-1, :]
join_club(800100200, 3, 'Member')

             role  club_id  student_id
0       President        1   800100200
1         Captain        2   800100201
2  Vice President        3   800100202
3         Officer        4   800100203
4       Treasurer        5   800100204
5       President        4   800100205
6          Member        3   800100200

In [129]:
# Add new user
# Inputs required: student_id, student_name
student_name = 'Luke Keuchly'
student_id = '800100207'
def add_user(student_name, student_id):
    students_df.loc[len(membership_df.index)] = [student_name, student_id]
    print(students_df)
add_user('Luke Keuchly', '800100207')

     student_name student_id
0  Patrick Dickey  800100200
1    Tom Yoxsimer  800100201
2   Cole Bauguess  800100202
3  Kevin Mcdonald  800100203
4  William Landon  800100204
5   Duane Shelton  800100205
7    Luke Keuchly  800100207

In [124]:
# Show clubs
# Inputs required: student_id
df = pd.DataFrame()
student_id = 800100200
clubs = pd.DataFrame()
club_ids = []
def showclubs(student_id):
    clubs = pd.DataFrame()
    df = membership_df[membership_df['student_id'] == student_id]

    for x in df['club_id']: 
        data = club_df[club_df['club_id'] == x]
        clubs = clubs.append(data)
    print(clubs)
    return(clubs)
new_df = showclubs(800100200)

      club_name  club_id  club_size  activity                communication
0    Chess Club        1         50        50  https://discord.gg/2DmmD9qm
2  Archery Club        3         10        50  https://discord.gg/2DmmD9qm

In [147]:
# Search for club
# Inputs required: club_name
club_name = 'Chess club'
def club_search(club_name):
    clubs = []
    club_name = club_name.lower()
    for x in club_df['club_name'].str.lower():
        if x.startswith(club_name):
            clubs.append(x)
    print(clubs)
    return(clubs)
club_search('a')

['archery club', 'alpha sigma phi']

['archery club', 'alpha sigma phi']

In [170]:
# Display clubs based on criteria
# Inputs required: any attribute of club
def club_slicer(min,max,attribute,slice_number=1,min2=0,max2=0,attribute2=''):
    club_slice = club_df[club_df[attribute] > min]
    club_slice = club_slice[club_slice[attribute] < max]
    print(club_slice)
    if slice_number == 2:
        club_slice = club_slice[club_slice[attribute2]>min2]
        club_slice = club_slice[club_slice[attribute2]<max2]
    print(club_slice)
    return club_slice

club_slicer(50,100,'club_size',2,40,60,'activity')

          club_name  club_id  club_size  activity                communication
1  Ultimate Frisbee        2         60        50               GroupMe invite
4     Rho Tau Sigma        5         70        50  https://discord.gg/2DmmD9qm
          club_name  club_id  club_size  activity                communication
1  Ultimate Frisbee        2         60        50               GroupMe invite
4     Rho Tau Sigma        5         70        50  https://discord.gg/2DmmD9qm

          club_name  club_id  club_size  activity                communication
1  Ultimate Frisbee        2         60        50               GroupMe invite
4     Rho Tau Sigma        5         70        50  https://discord.gg/2DmmD9qm

In [150]:
# Activity Rankings
# Inputs required: activity
club_df_sorted = club_df.sort_values('activity')
club_df_sorted

          club_name  club_id  club_size  activity                communication
0        Chess Club        1         50        50  https://discord.gg/2DmmD9qm
1  Ultimate Frisbee        2         60        50               GroupMe invite
2      Archery Club        3         10        50  https://discord.gg/2DmmD9qm
3   Alpha Sigma Phi        4        120        50  https://discord.gg/2DmmD9qm
4     Rho Tau Sigma        5         70        50  https://discord.gg/2DmmD9qm

In [81]:
# Next function
# Inputs required: